; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v9 ?v8)
             (pred_11 ?v7 ?v6)
             (pred_9 ?v9 ?v6)
             (pred_4 ?v10 ?v9 )
	     (pred_1 ?v9)
             (pred_3 ?v5)
             (pred_2 ?v7)
             (pred_6 ?v6)
             (pred_12 ?v9)
             (pred_8 ?v7)
             (pred_5 ?v9)
             (pred_7 ))



(:action op_2
:parameters (?v12 ?v11 ?v1 ?v13)
:precondition (and (pred_3 ?v12) (pred_3 ?v11) (pred_2 ?v1) (pred_6 ?v13)
          (pred_10 ?v12 ?v11) (pred_11 ?v1 ?v13)
                   (pred_9 ?v11 ?v13) (pred_1 ?v12) 
                   (pred_12 ?v11) (pred_8 ?v1))
:effect (and  (pred_5 ?v11) (not (pred_12 ?v11))))


(:action op_3
:parameters (?v12 ?v4)
:precondition (and (pred_3 ?v12) (pred_3 ?v4)
               (pred_1 ?v12) (pred_10 ?v12 ?v4) (pred_5 ?v4))
:effect (and (pred_1 ?v4) (not (pred_1 ?v12))))

(:action op_5
:parameters (?v12 ?v1)
:precondition (and (pred_3 ?v12) (pred_2 ?v1) 
                  (pred_1 ?v12) (pred_4 ?v1 ?v12) (pred_7 ))
:effect (and (pred_8 ?v1)
   (not (pred_4 ?v1 ?v12)) (not (pred_7 ))))


(:action op_1
:parameters (?v12 ?v3 ?v2)
:precondition (and (pred_3 ?v12) (pred_2 ?v3) (pred_2 ?v2)
                  (pred_1 ?v12) (pred_8 ?v2) (pred_4 ?v3 ?v12))
:effect (and (pred_8 ?v3) (pred_4 ?v2 ?v12)
        (not (pred_8 ?v2)) (not (pred_4 ?v3 ?v12))))

(:action op_4
:parameters (?v12 ?v1)
:precondition (and (pred_3 ?v12) (pred_2 ?v1) 
                  (pred_1 ?v12) (pred_8 ?v1))
:effect (and (pred_7 ) (pred_4 ?v1 ?v12) (not (pred_8 ?v1)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_26 obj_28 obj_19 obj_17 obj_18 obj_11 obj_14 obj_31 obj_16 obj_25 obj_12 obj_22 obj_05 obj_29 obj_23 obj_21 obj_08 obj_06 obj_03 obj_10 obj_07 obj_04 obj_27 obj_13
    obj_20 obj_02 obj_24
    obj_30 obj_09 obj_15
    )

    (:init
       (pred_7)

       (pred_3 obj_01)
       (pred_3 obj_26)
       (pred_3 obj_28)
       (pred_3 obj_19)
       (pred_3 obj_17)
       (pred_3 obj_18)
       (pred_3 obj_11)
       (pred_3 obj_14)
       (pred_3 obj_31)
       (pred_3 obj_16)
       (pred_3 obj_25)
       (pred_3 obj_12)
       (pred_3 obj_22)
       (pred_3 obj_05)
       (pred_3 obj_29)
       (pred_3 obj_23)
       (pred_3 obj_21)
       (pred_3 obj_08)
       (pred_3 obj_06)
       (pred_3 obj_03)
       (pred_3 obj_10)
       (pred_3 obj_07)
       (pred_3 obj_04)
       (pred_3 obj_27)
       (pred_3 obj_13)
       (pred_6 obj_20)
       (pred_6 obj_02)
       (pred_6 obj_24)
       (pred_2 obj_30)
       (pred_2 obj_09)
       (pred_2 obj_15)

       (pred_10 obj_01 obj_18)
       (pred_10 obj_01 obj_26)
       (pred_10 obj_26 obj_11)
       (pred_10 obj_26 obj_28)
       (pred_10 obj_26 obj_01)
       (pred_10 obj_28 obj_14)
       (pred_10 obj_28 obj_19)
       (pred_10 obj_28 obj_26)
       (pred_10 obj_19 obj_31)
       (pred_10 obj_19 obj_17)
       (pred_10 obj_19 obj_28)
       (pred_10 obj_17 obj_16)
       (pred_10 obj_17 obj_19)
       (pred_10 obj_18 obj_25)
       (pred_10 obj_18 obj_11)
       (pred_10 obj_18 obj_01)
       (pred_10 obj_11 obj_12)
       (pred_10 obj_11 obj_14)
       (pred_10 obj_11 obj_26)
       (pred_10 obj_11 obj_18)
       (pred_10 obj_14 obj_22)
       (pred_10 obj_14 obj_31)
       (pred_10 obj_14 obj_28)
       (pred_10 obj_14 obj_11)
       (pred_10 obj_31 obj_05)
       (pred_10 obj_31 obj_16)
       (pred_10 obj_31 obj_19)
       (pred_10 obj_31 obj_14)
       (pred_10 obj_16 obj_29)
       (pred_10 obj_16 obj_17)
       (pred_10 obj_16 obj_31)
       (pred_10 obj_25 obj_23)
       (pred_10 obj_25 obj_12)
       (pred_10 obj_25 obj_18)
       (pred_10 obj_12 obj_21)
       (pred_10 obj_12 obj_22)
       (pred_10 obj_12 obj_11)
       (pred_10 obj_12 obj_25)
       (pred_10 obj_22 obj_08)
       (pred_10 obj_22 obj_05)
       (pred_10 obj_22 obj_14)
       (pred_10 obj_22 obj_12)
       (pred_10 obj_05 obj_06)
       (pred_10 obj_05 obj_29)
       (pred_10 obj_05 obj_31)
       (pred_10 obj_05 obj_22)
       (pred_10 obj_29 obj_03)
       (pred_10 obj_29 obj_16)
       (pred_10 obj_29 obj_05)
       (pred_10 obj_23 obj_10)
       (pred_10 obj_23 obj_21)
       (pred_10 obj_23 obj_25)
       (pred_10 obj_21 obj_07)
       (pred_10 obj_21 obj_08)
       (pred_10 obj_21 obj_12)
       (pred_10 obj_21 obj_23)
       (pred_10 obj_08 obj_04)
       (pred_10 obj_08 obj_06)
       (pred_10 obj_08 obj_22)
       (pred_10 obj_08 obj_21)
       (pred_10 obj_06 obj_27)
       (pred_10 obj_06 obj_03)
       (pred_10 obj_06 obj_05)
       (pred_10 obj_06 obj_08)
       (pred_10 obj_03 obj_13)
       (pred_10 obj_03 obj_29)
       (pred_10 obj_03 obj_06)
       (pred_10 obj_10 obj_07)
       (pred_10 obj_10 obj_23)
       (pred_10 obj_07 obj_04)
       (pred_10 obj_07 obj_21)
       (pred_10 obj_07 obj_10)
       (pred_10 obj_04 obj_27)
       (pred_10 obj_04 obj_08)
       (pred_10 obj_04 obj_07)
       (pred_10 obj_27 obj_13)
       (pred_10 obj_27 obj_06)
       (pred_10 obj_27 obj_04)
       (pred_10 obj_13 obj_03)
       (pred_10 obj_13 obj_27)
       (pred_12 obj_16)
       (pred_12 obj_31)
       (pred_12 obj_13)
       (pred_9  obj_16 obj_20)
       (pred_9  obj_31 obj_02)
       (pred_9  obj_13 obj_24)
       (pred_5 obj_01)
       (pred_5 obj_26)
       (pred_5 obj_28)
       (pred_5 obj_19)
       (pred_5 obj_17)
       (pred_5 obj_18)
       (pred_5 obj_11)
       (pred_5 obj_14)
       (pred_5 obj_25)
       (pred_5 obj_12)
       (pred_5 obj_22)
       (pred_5 obj_05)
       (pred_5 obj_29)
       (pred_5 obj_23)
       (pred_5 obj_21)
       (pred_5 obj_08)
       (pred_5 obj_06)
       (pred_5 obj_03)
       (pred_5 obj_10)
       (pred_5 obj_07)
       (pred_5 obj_04)
       (pred_5 obj_27)

       (pred_11  obj_30 obj_20)
       (pred_11  obj_09 obj_02)
       (pred_11  obj_15 obj_24)
       (pred_4 obj_30 obj_01)
       (pred_4 obj_09 obj_25)
       (pred_4 obj_15 obj_10)
       (pred_1 obj_29)
    )

    (:goal (and
       (pred_4 obj_09 obj_14)
       (pred_4 obj_15 obj_07)
    ))
(:constraints
  (always (not (pred_1 obj_21)))
)
)

; plan
1. (op_3 obj_29 obj_05)
   deleted: (pred_1 obj_29)
   added: (pred_1 obj_05)
   goals met: 0 of 2
2. (op_3 obj_05 obj_22)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_22)
   goals met: 0 of 2
3. (op_3 obj_22 obj_12)
   deleted: (pred_1 obj_22)
   added: (pred_1 obj_12)
   goals met: 0 of 2
4. (op_3 obj_12 obj_25)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_25)
   goals met: 0 of 2
5. (op_3 obj_25 obj_23)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_23)
   goals met: 0 of 2
6. (op_3 obj_23 obj_10)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_10)
   goals met: 0 of 2
7. (op_5 obj_10 obj_15)
   deleted: (pred_4 obj_15 obj_10) (pred_7)
   added: (pred_8 obj_15)
   goals met: 0 of 2
8. (op_3 obj_10 obj_07)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_07)
   goals met: 0 of 2
9. (op_4 obj_07 obj_15)
   deleted: (pred_8 obj_15)
   added: (pred_7) (pred_4 obj_15 obj_07)
   goals met: 1 of 2
10. (op_3 obj_07 obj_10)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_10)
   goals met: 1 of 2
11. (op_3 obj_10 obj_23)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_23)
   goals met: 1 of 2
12. (op_3 obj_23 obj_25)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_25)
   goals met: 1 of 2
13. (op_5 obj_25 obj_09)
   deleted: (pred_4 obj_09 obj_25) (pred_7)
   added: (pred_8 obj_09)
   goals met: 1 of 2
14. (op_3 obj_25 obj_18)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_18)
   goals met: 1 of 2
15. (op_3 obj_18 obj_11)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_11)
   goals met: 1 of 2
16. (op_3 obj_11 obj_14)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_14)
   goals met: 1 of 2
17. (op_4 obj_14 obj_09)
   deleted: (pred_8 obj_09)
   added: (pred_7) (pred_4 obj_09 obj_14)
   goals met: 2 of 2
